app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["post", "Hey! I'm back bitches! :D"], ["created_at", "2020-09-10 02:09:46.516447"], ["updated_at", "2020-09-10 02:09:46.516447"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "post" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "Woof is up and running! \r\n\r\nComing up: Profiles, Groups/ Trends, End-end chat"], ["updated_at", "2020-09-10 02:42:59.121062"], ["id", 1]]